/// # 表达式
///
///
/// 语句：
/// - 绑定变量
/// - 表达式带上分号的
///
/// 代码块也是表达式，所以他们在赋值操作中可以充当右值，代码块中的最后一条表达式
/// 将赋值给左值。需要注意的是，如果代码块最后一条表达式结尾处有分号，那么返回值变成（）
///
/// 代码块中的最后一条语句是代码块中实际执行的最后一条语句，而不一定是代码块中最后一行的语句
///
pub fn expression_example () {
    //变量绑定
    let _x = 5;

    //表达式语句
    // x;
    // x + 1;
    // 15;

    let x = 5u32;

    let y = {
        let x_suqared = x * x;
        let x_cube = x_suqared * x;
        x_cube + x_suqared + x
    };


    let z = {
        // 2 * x;
    };

    println!("x is {:?}", x);
    println!("y is {:?}", y);
    println!("z is {:?}", z);
}